#### PipeFlowState Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing all the pipe flow states for a pipe

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum PipeFlowState ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration PipeFlowState ``` |

| Visual C++ |
| --- |
| ``` public enum class PipeFlowState ``` |

# Members

| Member name | Description |
| --- | --- |
| MultiValues | The flow state has multi values |
| LaminarState | The flow state is Laminar |
| TransitionState | The flow state is Transition |
| TurbulentState | The flow state is Turbulent |

# See Also

Autodesk.Revit.DB.Plumbing Namespace